# PathReinSpanhookPrim Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathReinSpanhookPrim Property
ParameterTypeId Class See Also
---
"Start Hook Angle Primary"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathReinSpanhookPrim { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinSpanhookPrim As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathReinSpanhookPrim {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace